app/controllers/posts_controller.rb

    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test edit"], ["content", "test edit"], ["updated_at", "2020-12-30 20:07:33.839753"], ["id", 4]]